In [137]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [138]:
titanic_data = pd.read_csv('titanic.csv')
titanic_data.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [139]:
titanic_data = titanic_data.drop(columns=['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'])

titanic_data.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [140]:
titanic_target = titanic_data['Survived']
titanic_data = titanic_data.drop(columns=['Survived'])

titanic_data.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [141]:
dummies = pd.get_dummies(titanic_data['Sex'])

titanic_data = pd.concat([titanic_data, dummies], axis='columns')

titanic_data = titanic_data.drop(columns=['Sex'])

titanic_data.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [142]:
titanic_data.columns[titanic_data.isna().any()]

Index(['Age'], dtype='object')

In [143]:
titanic_data['Age'][:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [144]:
titanic_data['Age'] = titanic_data['Age'].fillna(int(titanic_data['Age'].mean()))

titanic_data['Age'][:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    29.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [145]:
from sklearn.model_selection import train_test_split

train_x, test_x, train_y, test_y = train_test_split(titanic_data, titanic_target, train_size=.6)

In [146]:
len(train_x)

534

In [147]:
len(test_x)

357

In [148]:
len(titanic_data)

891

In [149]:
from sklearn.naive_bayes import GaussianNB
titanic_model = GaussianNB()

titanic_model

GaussianNB()

In [150]:
titanic_model.fit(train_x, train_y)

GaussianNB()

In [151]:
titanic_model.score(test_x, test_y)

0.7983193277310925

In [152]:
test_x.head(10)

     Pclass   Age      Fare  female  male
599       1  49.0   56.9292       0     1
211       2  35.0   21.0000       1     0
529       2  23.0   11.5000       0     1
497       3  29.0   15.1000       0     1
461       3  34.0    8.0500       0     1
258       1  35.0  512.3292       1     0
302       3  19.0    0.0000       0     1
88        1  23.0  263.0000       1     0
850       3   4.0   31.2750       0     1
819       3  10.0   27.9000       0     1

In [153]:
test_y[:10]

599    1
211    1
529    0
497    0
461    0
258    1
302    0
88     1
850    0
819    0
Name: Survived, dtype: int64

In [154]:
titanic_model.predict(test_x[:10])

array([0, 1, 0, 0, 0, 1, 0, 1, 0, 0], dtype=int64)

In [155]:
titanic_model.predict_proba(test_x[:10])

array([[8.34496270e-01, 1.65503730e-01],
       [3.87924477e-02, 9.61207552e-01],
       [9.72826896e-01, 2.71731044e-02],
       [9.88407140e-01, 1.15928600e-02],
       [9.88410933e-01, 1.15890668e-02],
       [1.15437087e-41, 1.00000000e+00],
       [9.85440245e-01, 1.45597553e-02],
       [2.19066173e-12, 1.00000000e+00],
       [9.78105161e-01, 2.18948388e-02],
       [9.82624617e-01, 1.73753828e-02]])